case/system/gas/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  8
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

convertToMeters 1.0; // Scale the domain to 1m x 1m x 2m

vertices
(
    (0 0 0)
    (1 0 0)
    (1 1 0)
    (0 1 0)
    (0 0 2)
    (1 0 2)
    (1 1 2)
    (0 1 2)
);

blocks
(
    hex (0 1 2 3 4 5 6 7) (32 32 64) simpleGrading (1 1 1)
);

boundary
(
    TOP
    {
        type patch;
        faces
        (
            (4 5 6 7)
        );
    }

    BOTTOM
    {
        type patch;
        faces
        (
            (0 3 2 1)
        );
    }

    AROUND
    {
        type wall;
        faces
        (
            (0 4 7 3)
            (2 6 5 1)
            (1 5 4 0)
            (3 7 6 2)
        );
    }
);


// ************************************************************************* //
